#pragma once
#include <iostream>
#include <vector>
using namespace::std;

class Game {
public:
	Game();//конструктор
	~Game();//деструктор
	void play();//метод запускающий игру
private:
	void printGameDesk();//метод отрисовки игрового поля
	void replayOrNot();//метод для рестарта
	void clearGameDesk();//метод для очистки игрового поля для рестарта
	bool victoryStradegy();//метод проверяющий на наличие уже выйгрышной стратегии
	bool alreadyFilled(int, int);//метод проверяющий свободна ли ячейка для выбора или нет
	void getPlayerChoice(int&, int&);//метод получения для выполнения хода игрока
	void doChoice(int, int, int);//метод выполнения хода игрока
	string gameDesk[6][7] = { { "11", "12", "13", "14", "15", "16", "17" },
	{ "21", "22", "23", "24", "25", "26", "27" },
	{ "31", "32", "33", "34", "35", "36", "37" },
	{ "41", "42", "43", "44", "45", "46", "47" },
	{ "51", "52", "53", "54", "55", "56", "57" },
	{ "61", "62", "63", "64", "65", "66", "67" } };//игровое поле
	string RESERVEgameDesk[6][7] = { { "11", "12", "13", "14", "15", "16", "17" },
	{ "21", "22", "23", "24", "25", "26", "27" },
	{ "31", "32", "33", "34", "35", "36", "37" },
	{ "41", "42", "43", "44", "45", "46", "47" },
	{ "51", "52", "53", "54", "55", "56", "57" },
	{ "61", "62", "63", "64", "65", "66", "67" } };//игровое поле для быстрой очистки при рестарте
};